/*----------------------------------------
¹¦ÄÜ: ÓÃHC-SR04³¬Éù²¨Ä£¿é²âÁ¿¾àÀë
²¢ÓÃµ¥Æ¬»ú(STC89C52RC)½ÓÊÕĞÅºÅ£¬¼ÆËã¾àÀë£¬
²¢ÔÚLCD1602ÉÏÊµÊ±ÏÔÊ¾µ±Ç°¾àÀë¡£
¾àÀë=£¨¸ßµçÆ½Ê±¼ä*ÉùËÙ£©/2£¬
¸ßµçÆ½Ê±¼ä¾ÍÊÇ³¬Éù²¨Íù·µµÄÊ±¼ä¡£
----------------------------------------*/
#include <Ultrasonic.h>	 //µ÷ÓÃÍ·ÎÄ¼şUltrasonic.h£º£¨ÆäÖĞ°üÀ¨Ò»Ğ©µ÷ÓÃÍ·ÎÄ¼ş£¬³õÊ¼»¯±äÁ¿£¬ºê¶¨ÒåºÍÒ»Ğ©º¯ÊıÉùÃ÷£©
#include <I2C.H>

/*¶¨ÒåÈ«¾Ö±äÁ¿*/
uint time = 0; // ¼ÇÂ¼»ØÉù¸ßµçÆ½³ÖĞøÊ±¼ä
float distance = 0; // ´æ·Å¾àÀë
unsigned  int jieshou;//´æ·Å´ÓPC¶Ë½ÓÊÕµ½µÄÊı¾İ
unsigned  int flag=0;//·¢ËÍÄ£¿éµÄÈ·ÈÏĞÅÏ¢

/*¶¨ÒåLCD1602ÏÔÊ¾Ä£¿éÏÔÊ¾µÄÄÚÈİ£¨ÓÃÊı×éĞÎÊ½´æÖü£©*/
//LCD1602ÏÔÊ¾µÄµÚÒ»ĞĞĞÅÏ¢Ô¤Áô¸ø¹âÕÕÄ£¿é
uchar code table0[] = {"GQ:"};		  //±ê×¢ĞÅÏ¢£º¹âÇ¿
uchar code table4[] = {"Lux"};		  //µ¥Î»:LuxÀÕ¿ËË¹
// ±äÁ¿¶¨Òå
unsigned char AD_CHANNEL;
unsigned long xdata  LedOut[4]={0,0,0,0};	 //´æ·Å´¦Àí¹ıºóµÄ¹âÇ¿ĞÅÏ¢
unsigned int  D[32];
unsigned char date;



//LCD1602ÏÔÊ¾µÄµÚ¶şĞĞĞÅÏ¢£¬ÏÔÊ¾³¬Éù²¨²â¾àÄ£¿é£º
uchar code table1[] = {"Distance:"};  //±ê×¢ĞÅÏ¢
uchar code table2[] = {"0123456789"}; //¾àÀë
uchar code table3[] = {"mm"};		  //µ¥Î»:mm
// ±äÁ¿¶¨Òå
uchar num = 0;
uint nn=0;
uchar dis[4];//´æ·Å´¦Àí¹ıºóµÄ¾àÀëĞÅÏ¢


/*Ö÷º¯Êı*/
void main(){
    
	LCDInit();//LCDÏÔÊ¾³õÊ¼»¯º¯Êı
	timerInit();//¶¨Ê±Æ÷0ºÍ1³õÊ¼»¯º¯Êı
	while(1){
		int i=0;		
	     /*******ÒÔÏÂ³¬Éù²¨¾àÀë´¦Àí*********/ 		
		uint disINT = (uint)distance;	   //Ç¿ÖÆÀàĞÍ×ª»»£¬½«¸¡µãĞÍÊı¾İ£¨float£©dat×ª»»³ÉÎŞ·ûºÅÕûĞÍÊı¾İ£¨unsigned int£©
		/*ÏÈ¹Ø±Õ·äÃùÆ÷*/
	    fm=1;

		echo = 0; // ½ÓÊÕ»ØÒô¶ËÖÃ0
		startUltra(); // Æô¶¯³¬Éù²â¾à
		while(!echo); // µÈ´ı»ØÒô
		TR0 = 1; // ¿ªÊ¼¼ÆÊ±
		while(echo);
		TR0 = 0; // Í£Ö¹¼ÆÊ±
		computeDis(); // ¼ÆËã¾àÀë

		//¼ÆËã¾àÀëÖµ£¬È»ºó½«Öµ´«¸ø´®¿Ú²¢Í¨¹ıdisplay£¨£©ÏÔÊ¾µ½LCDÏÔÊ¾Æ÷ÉÏ		
     	dis[0] = disINT / 1000;        //È¡³öÇ§Î»
    	dis[1] = disINT % 1000 / 100;  //È¡³ö°ÙÎ»
	    dis[2] = disINT % 100 / 10;	   //È¡³öÊ®Î»
	    dis[3] = disINT % 10;          //È¡³ö¸öÎ»


	    //µ¹³µ±¨¾¯Ä£¿é
		//Çé¿ö1£º
		//µ±³µÎ²¾àÀëÇ½±ÚĞ¡ÓÚ500mmÊ±·äÃùÆ÷ÃùµÑ±¨¾¯
		if(disINT<=500)
		{
			fm=0;
		}
		//Çé¿ö2£º
		//µ±³µÎ²¾àÀëÇ½±Ú´óÓÚ500mmÊ±Æû³µ´¦ÓÚ°²È«×´Ì¬£¬·äÃùÆ÷²»Ïì
		else
		{
			fm=1;
		}
		
		/********ÒÔÏÂ½«¾àÀëÖµÍ¨¹ı´®¿Ú·¢ËÍ³öÈ¥************/

		
		if(flag==1)        //·¢ËÍÊı¾İÌõ¼ş£¬¿ª¹ØÔÚ´®¿ÚÖĞ¶Ïº¯ÊıÖĞ£¬µ±½ÓÊÕÍêPC¶ËĞÅÏ¢ºó×Ô¶¯´¥·¢
     {
		ES=0;  //¹Ø±Õ´®¿ÚÖĞ¶Ï£¬ÏÈ½«ĞèÒª·¢ËÍ¸øPC¶ËµÄµ¹³µ¾àÀëÊı¾İ£¬°´Î»·¢ËÍ¸øPC¶ËÖ±µ½È«²¿·¢ËÍÍê±Ï
         for(i=0;i<4;i++)
		 {
         SBUF=dis[i];//´æÒ»Ìõ·¢Ò»Ìõ£¬Ö±µ½·¢ÍêÎªÖ¹
         while(!TI);
         TI=0;              //Èí¼şÇå0£¬È»ºóÑ­»·ÏÂÒ»´Î×Ö·û
     	 }

		//ES=1; //¿ªÆô´®¿ÚÖĞ¶ÏµÈ´ıÏÂÒ»´ÎµÄPC¶ËÊı¾İ·¢ËÍ£¨Ò²¾ÍÊÇµ¥Æ¬»úµÈ´ı½ÓÊÕ£©
	    //flag=0;
	 }


		delay(100);
		/*·¢ËÍ¾àÀëºÍ¹âÕÕÇ¿¶ÈµÄÊ±¼äÃ¿¸ô100ms·¢Ò»´Î*/
		/********ÒÔÏÂAD-DA´¦Àí*************/  	
	     switch(AD_CHANNEL)
		 {
			 case 0: ISendByte(PCF8591,0x41);
			      D[0]=IRcvByte(PCF8591);  //ADC0 Ä£Êı×ª»»1      ¹âÃôµç×è
				  break;  
			
			 case 1: ISendByte(PCF8591,0x42);
			      D[1]=IRcvByte(PCF8591);  //ADC1  Ä£Êı×ª»»2	  ÈÈÃôµç×è
				  break;  
			
			 case 2: ISendByte(PCF8591,0x43);
			      D[2]=IRcvByte(PCF8591);  //ADC2	Ä£Êı×ª»»3	   Ğü¿Õ
				  break;  
			
			 case 3: ISendByte(PCF8591,0x40);
			      D[3]=IRcvByte(PCF8591);  //ADC3   Ä£Êı×ª»»4	   ¿Éµ÷0-5v
				  break;  
			
			 case 4: DACconversion(PCF8591,0x40, D[4]); //DAC	  ÊıÄ£×ª»»
			      break;
		 
		 }

       D[4]=D[3];  //°ÑÄ£ÄâÊäÈë²ÉÑùµÄĞÅºÅ Í¨¹ıÊıÄ£×ª»»Êä³ö
	   	   	
	   if(++AD_CHANNEL>4) AD_CHANNEL=0;
	
	   //¼ÆËãADÖµ£¬È»ºó½«Öµ´«¸ø´®¿Ú²¢Í¨¹ıdisplay£¨£©ÏÔÊ¾µ½LCDÏÔÊ¾Æ÷ÉÏ£¬ÎÒÃÇÎªÁËÌá¸ßÁéÃô¶È£¬½«Êı¾İ´óĞ¡À©´óÁË10±¶	 	
       LedOut[0] = D[3]/100%10;
       LedOut[1] = D[3]/10%10;
       LedOut[2] = D[3]/1%10;
	   LedOut[3] = D[3]*10%10;	

		//³µ¿â²¹¹âÄ£¿é
	   	//Çé¿ö1£º
		//µ±³µ¿âÁÁ¶ÈĞ¡ÓÚµÈÓÚ1290ÀÕ¿ËË¹,Èı¸öĞ¡µÆ¾ù²»ÁÁ
		if(D[3]*10<=1290)
		{
			l2=1;
			l3=1;
			l4=1;
		}

		//Çé¿ö2£º
		//µ±³µ¿âÁÁ¶È´óÓÚµÈÓÚ1300ÀÕ¿ËË¹£¬Ğ¡ÓÚ1310ÀÕ¿ËË¹Ê±£¬Ğ¡µÆP22ÁÁµÆ
		else if((D[3]*10>=1300)&&(D[3]*10<1310))
		{
			l2=0;
			l3=1;
			l4=1;
		}

		//Çé¿ö3£º
		//µ±³µ¿âÁÁ¶È´óÓÚµÈÓÚ1310ÀÕ¿ËË¹£¬Ğ¡ÓÚ1320ÀÕ¿ËË¹Ê±£¬Ğ¡µÆP22ÁÁµÆ,Ğ¡µÆP23ÁÁµÆ
		else if((D[3]*10>=1310)&&(D[3]*10<1320))
		{
		    l2=0;
			l3=0;
			l4=1;
		}

		//Çé¿ö4£º
		//µ±³µ¿âÁÁÈ´óÓÚµÈÓÚ1320ÀÕ¿ËË¹Ê±£¬Ğ¡µÆP22ÁÁµÆ,Ğ¡µÆP23ÁÁµÆ,Ğ¡µÆP24ÁÁµÆ
		else if(D[3]*10>=1320)
		{
			l2=0;
			l3=0;
			l4=0;
		}
	   

	    
	   /********ÒÔÏÂ½«ADµÄÖµÍ¨¹ı´®¿Ú·¢ËÍ³öÈ¥*************/
	   
	   if(flag==1)        //·¢ËÍÊı¾İÌõ¼ş£¬¿ª¹ØÔÚ´®¿ÚÖĞ¶Ïº¯ÊıÖĞ£¬µ±½ÓÊÕÍêPC¶ËĞÅÏ¢ºó×Ô¶¯´¥·¢
     {
		//ES=0;  //¹Ø±Õ´®¿ÚÖĞ¶Ï£¬ÏÈ½«ĞèÒª·¢ËÍ¸øPC¶ËµÄ¹âÕÕÇ¿¶ÈÊı¾İ£¬°´Î»·¢ËÍ¸øPC¶ËÖ±µ½È«²¿·¢ËÍÍê±Ï
       	 for(i=0;i<4;i++)
		 {
         SBUF=LedOut[i];//´æÒ»Ìõ·¢Ò»Ìõ£¬Ö±µ½·¢ÍêÎªÖ¹
         while(!TI);
         TI=0;              //Èí¼şÇå0£¬È»ºóÑ­»·ÏÂÒ»´Î×Ö·û
   		 }

		ES=1; //¿ªÆô´®¿ÚÖĞ¶ÏµÈ´ıÏÂÒ»´ÎµÄPC¶ËÊı¾İ·¢ËÍ£¨Ò²¾ÍÊÇµ¥Æ¬»úµÈ´ı½ÓÊÕ£©
	    
	 }
	 		
		
		display(); // ÔÚLCDÏÔÊ¾ÆÁÉÏÏÔÊ¾¹âÕÕÇ¿¶È£¨µÚÒ»ĞĞ£©ºÍµ¹³µ¾àÀë£¨µÚ¶şĞĞ£©
	}
}

/*==============================================
£¡£¡£¡£¡£¡ÒÔÏÂÎªHC-SR04³¬Éù²¨Ä£¿éµÄÉèÖÃ£º£¡£¡£¡£¡
===============================================*/
/*Æô¶¯³¬Éù²¨²â¾à*/
void startUltra(){ // ²úÉúÒ»¸ö´óÓÚ10usµÄ¸ßµçÆ½£¬HC-SR04³¬Éù²¨Ä£¿éµÄÆô¶¯Ìõ¼ş£¡
	trig = 1;
	delayUs(15);
	trig = 0;
}

/*¶¨Ê±Æ÷0ºÍ1³õÊ¼»¯º¯Êı*/
void timerInit(){
	TMOD = 0x21; // ¶¨Ê±Æ÷1 ¶¨Ê±Ä£Ê½ ¹¤×÷·½Ê½2 8Î»×Ô¶¯ÖØ×°ÔØ
			   	// ¶¨Ê±Æ÷0 ¶¨Ê±Ä£Ê½ ¹¤×÷·½Ê½1 ·ÇÃÅ¿ØÆô¶¯
	TH0 = 0x00; //ÉèÖÃ¶¨Ê±Ê±¼ä
	TL0 = 0x00;	//ÉèÖÃ¶¨Ê±Ê±¼ä
	TL1=0XFa;  //³õÖµÎª250£¬²¨ÌØÂÊÎª£º4800
    TH1=0XFa;  //³õÖµÎª250£¬²¨ÌØÂÊÎª£º4800
	TR1=1;  //Æô¶¯¶¨Ê±Æ÷T1£¡
	SM0=0;     //Éè¶¨´®¿Ú¹¤×÷·½Ê½
    SM1=1;     //·½Ê½1£¬SM0=0£¬SM1=1
    REN=1;     //×¼Ğí´®¿Ú½ÓÊÕ£¬ÏÖÔÚÏÈÉè¶¨ÎªÖ»·¢ËÍĞÅÏ¢µ½PC¶Ë
	ET0 = 1; // ¿ªtimer0Òç³öÖĞ¶Ï
	EA = 1; // ¿ªÈ«¾ÖÖĞ¶Ï
    ES=1;   //¿ª´®¿ÚÖĞ¶Ï
	
}

/*Ô­¶¨ÓÃ£º¶¨Ê±Æ÷1½øĞĞ¼ÆÊ±ÈÃµ¥Æ¬»úÃ¿1sÖÓ²âÊÔÒ»´Î¾àÀëºÍ¹âÕÕÇ¿¶È£¬
ÔÚ¶¨Ê±Æ÷1µÄÖĞ¶Ïº¯ÊıÖĞÍ¬Ê±°ì²â¾àºÍ²â¹âÇ¿Á½¼şÊÂ£¡£¡*/
/*
void timer1Service() interrupt 3  //¶¨Ê±Æ÷T1  3.5
{
	TH1=(65536-50000)/256; //ÉèÖÃ¶¨Ê±Ê±¼ä
	TL1=(65536-50000)%256; //ÉèÖÃ¶¨Ê±Ê±¼ä 	
	nn++;
	if(nn==20)//20*20ms=1sÖÓ¼ÆÊ±Ò»´Î£¬ÈÃ¶¨Ê±Æ÷½øÈëÁ½¸ö²âÁ¿²¿·Ö£»
	{

		//³¬Éù²¨²â¾àÀë²¿·Ö£º
		echo = 0; // ½ÓÊÕ»ØÒô¶ËÖÃ0
		startUltra(); // Æô¶¯³¬Éù²â¾à
		while(!echo); // µÈ´ı»ØÒô
		TR0 = 1; // ¿ªÊ¼¼ÆÊ±
		while(echo);
		TR0 = 0; // Í£Ö¹¼ÆÊ±
		computeDis(); // ¼ÆËã¾àÀë
		display(distance); // ÏÔÊ¾¾àÀë£¨µ¥Î»mmºÁÃ×£©

		//¹âÃôµç×è²â¹âÕÕÇ¿¶È²¿·Ö£º
		//µÈ´ıÒ»ÊÖ²Ë¹·Ìï½¨°î£¡

		//¶Ô¶¨Ê±Æ÷1s½øĞĞÇåÁã
		nn=0;	
	}
}
*/


/*½ÓÊÕPC¶ËÊı¾İÄ£¿é£¬´®¿ÚÖĞ¶Ï£¬ÔÚÕâÀïÊÇÓÃÀ´½ÓÊÕPC¶ËµÄÒ»¸öÈ·ÈÏĞÅÏ¢£¬½ÓÊÕµ½Ôò´ò¿ªmainº¯ÊıÖĞµÄ·¢ËÍÊı¾İÄ£¿é*/

void ser() interrupt 4    //µ±½ÓÊÕµ½PC·¢ËÍµÄÊı¾İÊ±£¬×Ô¶¯½øÈëÖĞ¶Ï³ÌĞò
{
  
  jieshou=SBUF;//½«½ÓÊÕµ½µÄÊı¾İ´æµ½aÖĞ,ÕâÀïÒªÇóPC¶Ë·¢ËÍÒ»¸ö0£¬Ò²¾ÍÊÇµÍµçÆ½£¬µ±PC¶Ë·¢ËÍ0Ê±Ôòµ¥Æ¬»ú·äÃùÆ÷Ïì1sÖÓ´ú±í½ÓÊÕµ½PC¶ËÈ·ÈÏĞÅÏ¢
  fm=jieshou;
  delay(1000);//·äÃùÆ÷ÏìÒ»ÃëÖÓ£¬±íÊ¾½ÓÊÕµ½ÁËPC¶ËĞÅÏ¢
  fm=1;
  flag=1;  //flagÊÇmainº¯ÊıÖĞ£¬µ¥Æ¬»ú·¢ËÍÊı¾İµÄÌõ¼ş
  RI=0;    //½«R1Çå0µÈ´ıÏÂÒ»´Î½ÓÊÕÊı¾İ
  //ES=0;    //½ÓÊÕµ½Ò»´Îpc¶ËµÄÇëÇó·¢ËÍLCDĞÅÏ¢ºó£¬Ôò¹Ø±Õ´®¿ÚÖĞ¶Ï£¬Ö±½Ó½«LCDÏÔÊ¾µÄ²âµÃÊı¾İ·¢ËÍ¸øPC¶Ë
  REN=0;
    
}


/*¶¨Ê±Æ÷0Òç³öÖĞ¶Ï·şÎñ³ÌĞò*/
void timer0Service() interrupt 1{ // ¼ÆÊıÒç³öËµÃ÷³¬³ö²â¾à·¶Î§
	echo = 0; // Ç¿ÖÆ¹Ø±Õ»ØÒô
}

/*ÑÓÊ±x * 1 us*/
void delayUs(uint xus){
	uint i;
	for(i = xus; i > 0; i--){
		_nop_();			//¿Õº¯Êı_nop()_£¬Ïàµ±ÓÚÒ»¸ö¶ÌÔİÑÓÊ±£º1us
	}
}

/*¼ÆËã¾àÀë*/
void computeDis(){
	time = TH0 * 256 + TL0;    //Ê±¼ä×ª»»Îªtime
	distance = FACTOR * time;  //FACTORºê¶¨Òå¹ıÎª£º0.1845
	TH0 = 0x00; // ÖØ×°³õÖµ
	TL0 = 0x00;
}

/*==============================================
£¡£¡£¡£¡£¡£¡ÒÔÏÂÎªLCD1602µÄÏÔÊ¾ÉèÖÃ£º£¡£¡£¡£¡£¡£¡
===============================================*/

/*³õÊ¼»¯LCD1602µÄÉèÖÃ*/
void LCDInit(){
	uchar i;
	lcden = 0; // À­µÍÊ¹ÄÜ¶Ë£¬×¼±¸²úÉúÊ¹ÄÜ¸ßÂö³åĞÅºÅ
	writeCommand(0x38); // ÏÔÊ¾Ä£Ê½ÉèÖÃ(16x2£¬ 5x7µãÕó£¬8Î»Êı¾İ½Ó¿Ú)
	writeCommand(0x0c); // ¿ªÏÔÊ¾£¬²»ÏÔÊ¾¹â±ê
	writeCommand(0x06); // Ğ´Ò»¸ö×Ö·ûºóµØÖ·Ö¸Õë×Ô¶¯¼Ó1
	writeCommand(0x01); // ÏÔÊ¾ÇåÁã£¬Êı¾İÖ¸ÕëÇåÁã
	
	/*LCDÉÏµç½çÃæ*/	 

	//µÚÒ»ĞĞµÄÉèÖÃ£ºÓÃÀ´ÏÔÊ¾¹âÕÕÇ¿¶È¿ØÖÆ¿ª¹ØµÆ
	writeCommand(0x80); // ½«Êı¾İÖ¸Õë¶¨Î»µ½µÚÒ»ĞĞÊ×
	for(i = 0; i < strlen(table0); i++){
		writeDataLCD(table0[i]);
		delay(5);
	}	  
	
	
	//µÚ¶şĞĞµÄÉèÖÃ£ºÓÃÀ´ÏÔÊ¾¹âÕÕÇ¿¶È¿ØÖÆĞ¡³µ
	writeCommand(0x80 + 0x40); // ½«Êı¾İÖ¸Õë¶¨Î»µ½µÚ¶şĞĞÊ×
	for(i = 0; i < strlen(table1); i++){
		writeDataLCD(table1[i]);  //±ê×¢ĞÅÏ¢:Distance
		delay(5);
	}
}

/*LCDÏÔÊ¾º¯Êı*/
void display(){
	/*¹âÃô²â¹âÇ¿²¿·ÖµÚÒ»ĞĞÏÔÊ¾*/	
	uchar  i;	 	
	for(i = 0; i < 4; i++){
		writeCommand(0x80 + 0x00 + strlen(table0) + i);
		writeDataLCD(table2[LedOut[i]]);//¹âÕÕÇ¿¶È
		delay(5);
	}
	for(i = 0; i < strlen(table4); i++){
		writeCommand(0x80 + 0x00 + strlen(table0) + 4 + i);
		writeDataLCD(table4[i]);    //µ¥Î»£ºLux
		delay(5);
	}


	/*³¬Éù²¨²â¾à²¿·ÖµÚ¶şĞĞÏÔÊ¾*/
		
	for(i = 0; i < 4; i++){
		writeCommand(0x80 + 0x40 + strlen(table1) + i);
		writeDataLCD(table2[dis[i]]);//¾àÀë
		delay(5);
	}
	for(i = 0; i < strlen(table3); i++){
		writeCommand(0x80 + 0x40 + strlen(table1) + 4 + i);
		writeDataLCD(table3[i]);    //µ¥Î»£ºmm
		delay(5);
	}

}

/*Ğ´Ö¸Áîº¯Êı*/
void writeCommand(uchar command){
	lcdrs = 0; // ÃüÁîÑ¡Ôñ
	lcdrw = 0;
	P0 = command;
	delay(5);
	
	lcden = 1; // ²úÉúÒ»¸öÕıÂö³åÊ¹ÄÜĞÅºÅ
	delay(5);
	lcden = 0;
}

/*Ğ´Êı¾İº¯Êı*/
void writeDataLCD(uchar dat){
	lcdrs = 1; // Êı¾İÑ¡Ôñ
	lcdrw = 0;
	P0 = dat;
	delay(5);
	
	lcden = 1;
	delay(5);
	lcden = 0;
}

/*ÑÓÊ±x* 1 msº¯Êı*/
void delay(uint xms){
	uint i, j;
	for(i = xms; i > 0; i--)
		for(j = 125; j > 0; j--);
}

/*¹âÃôÄ£¿éad×ª»»£º*/
/*******************************************************************
DAC ±ä»», ×ª»¯º¯Êı               
*******************************************************************/
bit DACconversion(unsigned char sla,unsigned char c,  unsigned char Val)
{
   Start_I2c();              //Æô¶¯×ÜÏß
   SendByte(sla);            //·¢ËÍÆ÷¼şµØÖ·
   if(ack==0)return(0);
   SendByte(c);              //·¢ËÍ¿ØÖÆ×Ö½Ú
   if(ack==0)return(0);
   SendByte(Val);            //·¢ËÍDACµÄÊıÖµ  
   if(ack==0)return(0);
   Stop_I2c();               //½áÊø×ÜÏß
   return(1);
}

/*******************************************************************
ADC·¢ËÍ×Ö½Ú[ÃüÁî]Êı¾İº¯Êı               
*******************************************************************/
bit ISendByte(unsigned char sla,unsigned char c)
{
   Start_I2c();              //Æô¶¯×ÜÏß
   SendByte(sla);            //·¢ËÍÆ÷¼şµØÖ·
   if(ack==0)return(0);
   SendByte(c);              //·¢ËÍÊı¾İ
   if(ack==0)return(0);
   Stop_I2c();               //½áÊø×ÜÏß
   return(1);
}

/*******************************************************************
ADC¶Á×Ö½ÚÊı¾İº¯Êı               
*******************************************************************/
unsigned char IRcvByte(unsigned char sla)
{  unsigned char c;

   Start_I2c();          //Æô¶¯×ÜÏß
   SendByte(sla+1);      //·¢ËÍÆ÷¼şµØÖ·
   if(ack==0)return(0);
   c=RcvByte();          //¶ÁÈ¡Êı¾İ0

   Ack_I2c(1);           //·¢ËÍ·Ç¾Í´ğÎ»
   Stop_I2c();           //½áÊø×ÜÏß
   return(c);
}



